class Settings:
    is_work = True


#Словарик с командами и основными словами бота, типо небольшая иишка
commands_dict = {
    "alias": ('помощник', "бот", "помощь", "ты", "среда", "голосовой", "троечка"),
    "tbr": ("помоги", 'скажи', 'расскажи', 'покажи', 'сколько', 'произнеси', "какой"),
    'commands': {
        "here": ['тут', 'спишь', 'на месте'],
        "thanks": ["спасибо", "благодарю", 'благодарствую'],
        'off': ['пока', "отключись", "до свидания"],
        'greeting': ['привет', 'приветствую', 'приветик', 'ку', 'здравия'],
        'date_now': ['текущее время', 'сейчас времени', 'который час'],
        "weather": ["какая погода", "погода", "погоду"],
        "curs": ["евро", "доллар", "курс валют"],
    }
}
