# Вспомогательный словарь, в котором должны содержаться все склоняемые слова.
D_WORDS = {
    "час": {
        "R": "часов",
        "I": "час",
        "K": "часа"
    },

    "минута": {
        "R": "минут",
        "I": "минута",
        "K": "минуты"
    },

    "секунда": {
        "R": "секунд",
        "I": "секунда",
        "K": "секунды"
    },

    "рубль": {
        "R": "рублей",
        "I": "рубль",
        "K": "рубля"
    },

    "копейка": {
        "R": "копеек",
        "I": "копейка",
        "K": "копейки"
    },

    "метр": {
        "R": "метров",
        "I": "метр",
        "K": "метра"
    },

    "паскаль": {
        "R": "паскалей",
        "I": "паскаль",
        "K": "паскаля"
    },

    "фаренгейт": {
        "R": "фаренгейт",
        "I": "фаренгейт",
        "K": "фаренгейта"
    }
}

MONTH_KEYS = ["января", "февраля", "марта", "апреля", "мая", "июня",
              "июля", "августа", "сентября", "октября", "ноября", "декабря"]

LANGUAGES = {
    "ar": ["арабский"],
    "bg": ["болгарский"],
    "bn": ["бенгальский",
           "бенгал"],
    "bs": ["боснийский"],
    "cs": ["чешский"],
    "da": ["датский"],
    "de": ["немецкий"],
    "el": ["греческий"],
    "en": ["английский"],
    "es": ["испанский"],
    "et": ["эстонский"],
    "fi": ["финский"],
    "fr": ["французский"],
    "hi": ["хинди"],
    "hr": ["хорватский"],
    "hu": ["венгерский"],
    "id": ["индонезийский"],
    "is": ["исландский"],
    "it": ["итальянский"],
    "ja": ["японский"],
    "ko": ["корейский"],
    "la": ["латинский"],
    "lv": ["латвийский"],
    "ms": ["малайский"],
    "ne": ["непальский"],
    "nl": ["голландский",
           "нидерландский"],
    "no": ["норвежский"],
    "pl": ["польский"],
    "pt": ["португальский"],
    "ro": ["румынский"],
    "sk": ["словацкий"],
    "sq": ["албанский"],
    "sr": ["сербский"],
    "sv": ["шведский"],
    "th": ["тайский"],
    "tr": ["турецкий"],
    "uk": ["украинский"],
    "vi": ["вьетнамский"],
    "zh-CN": ["китайский"]
}
