# Вспомогательный словарь, в котором должны содержаться все склоняемые слова.
D_WORDS = {
    "час": {
        "R": "часов",
        "I": "час",
        "K": "часа"
    },

    "минута": {
        "R": "минут",
        "I": "минута",
        "K": "минуты"
    },

    "рубль": {
        "R": "рублей",
        "I": "рубль",
        "K": "рубля"
    },

    "копейка": {
        "R": "копеек",
        "I": "копейка",
        "K": "копейки"
    },

    "метр": {
        "R": "метров",
        "I": "метр",
        "K": "метра"
    },

    "паскаль": {
        "R": "паскалей",
        "I": "паскаль",
        "K": "паскаля"
    },

    "фаренгейт": {
        "R": "фаренгейт",
        "I": "фаренгейт",
        "K": "фаренгейта"
    }
}

MONTH_KEYS = ["января", "февраля", "марта", "апреля", "мая", "июня",
              "июля", "августа", "сентября", "октября", "ноября", "декабря"]
