# Вспомогательный словарь, в котором должны содержаться все склоняемые слова.
usages = {
    "час": {
        "R": "часов",
        "I": "час",
        "K": "часа"
    },

    "минута": {
        "R": "минут",
        "I": "минута",
        "K": "минуты"
    },

    "рубль": {
        "R": "рублей",
        "I": "рубль",
        "K": "рубля"
    },

    "копейка": {
        "R": "копеек",
        "I": "копейка",
        "K": "копейки"
    },

    "градус": {
        "R": "градусов",
        "I": "градус",
        "K": "градуса"
    },

    "процент": {
        "R": "процентов",
        "I": "процент",
        "K": "процента"
    },

    "Паскаль": {
        "R": "Паскалей",
        "I": "Паскаль",
        "K": "Паскаля"
    },

    "метр": {
        "R": "метров",
        "I": "метр",
        "K": "метра"
    }
}

month_keys = ["января", "февраля", "марта", "апреля", "мая", "июня",
             "июля", "августа", "сентября", "октября", "ноября", "декабря"]